# Energy Analysis Surface Azimuth Property

Source: https://www.revitapidocs.com/2026/b70b6d11-7a42-0002-90f6-107ddca0e708.htm

---

| Energy Analysis Surface Azimuth Property |
| --- |

The azimuth angle for this surface, in radians.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double Azimuth { get; }
```

```
Public ReadOnly Property Azimuth As Double
	Get
```

```
public:
property double Azimuth {
	double get ();
}
```

```
member Azimuth : float with get
```

#### Property Value

Double Remarks The azimuth is computed as the angle of rotation between
 the outward normal of the surface and the Y\-axis (clockwise is positive). See Also

#### Reference

EnergyAnalysisSurface Class Autodesk.Revit.DB.Analysis Namespace